{
  "id": "TVL34MFHD3Q6FGHK2DYAQQYX",
  "name": "Foosball Soccer Table 4FT Tables Football Game Home Party Gift",
  "description": "If foosball is your thing, this competition-sized foosball table by Randy & Travis Machinery belongs in your home. Made from sturdy MDF with solid steel rods finished in sparkling chrome, this table is built to last, even under everyday use. Slide bearings provide smooth rotation, while ball serve cups on each side make it easy to get the game rolling. It's suitable for the whole family and makes the perfect addition to your rumpus room or a great gift for your foosball-loving kids or teens.\r\n\r\nIts small footprint minimises the space it takes up while maximising your fun. Only 43.5 inches long, it can even fit into a child or teen's bedroom. Beautiful graphics mimic the look of a real football pitch, and anti-slip grips on the rod bars give players perfect control. Manual scorers keep track of each team or player's score. It's easy to set up and comes with everything you need to start playing as soon as you set it up. On sunny days, you can even take it outside to catch some rays as you play your favourite table game. This foosball table makes a wonderful holiday or birthday gift for your kids, your partner, or the entire family. Get yours today!\r\n\r\nFeatures and specifications:\r\n\r\nMaterial: MDF fibreboard, PVC cover, and chrome-finished steel\r\nColour: Multi\r\nDimensions: 110 x 66 x 83.5cm (L x W x H)\r\nWeight: 16.5kg\r\nRods: 8 (4 per team)\r\nPlayers: 11 black and 11 light yellow\r\nGoals: 2\r\nAccessories: 2 balls, assembly manual, and 2 manual scorers\r\nSlide bearings provide smooth rotation\r\nBall serve cups on each side\r\nAnti-slip grips give players superb control\r\nErgonomic design",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-08-01T09:32:35.735Z",
  "updatedAt": "2025-08-01T09:47:28.166Z",
  "downloadedAt": "2025-08-03T02:21:33.938Z"
}
