{
  "id": "OXD4B6V4J3CVIHQY6DQR3RQL",
  "name": "L'ORACLE BY SISTERS ASTRO",
  "description": "L'Oracle by Sisters Astro a été conçu pour vous accompagner au quotidien à l'aide de messages, conseils et rituels.\n\nPensez à vous, soyez qui vous avez envie d'être, réalisez vos rêves. Pour que chaque jour qui passe ne soit plus laissé au hasard. <3\n\nCe coffret contient : \n\n• 50 cartes illustrées \n• Un livret de 80 pages avec 6 exemples de tirages et l'interprétation de chacune des cartes\n• Une pochette pour transporter votre oracle et le consulter où que vous soyez\n\nToutes les cartes sont en symbiose et choisies ensemble pour représenter les différents cycles de la vie. Chacune d’elles puise son inspiration dans l’astrologie, la numérologie et les lois universelles spirituelles. Un mélange de philosophie, de psychologie et de poésie pour vous laisser les clés de votre propre interprétation.\n\n\"Cet oracle est l'aboutissement de mon éveil spirituel, que je souhaite aujourd'hui partager avec vous. Il y a plusieurs années, une suite d'évènements est venue éveiller en moi une quête de sens. Pourquoi sommes-nous là ensemble ? Pourquoi suis-je là, moi ? La science et la spiritualité ne sont pas si éloignées. Pour comprendre notre monde, il faut accepter sa part d'ombre. Son inconnu, son mystère. Un monde où l'on ne croit pas est un monde sans rêves. Un monde où l’on ne voit pas est au contraire un monde sans trêve. Imaginons. Écrivons notre monde. Donnons-lui du sens et rendons-lui sa magie, que l'on appelle : Énergie.\"\n\n- Jenny Finkelstein, fondatrice de Sisters Astro.\n\nEditions Marabout - Hachette\nAuteurs : Jenny Finkelstein, Leslie Cazemajor\nIllustrations : Aurélie Redlips\n\nKit n°3 :\n\nSauge, palo + aragonite bleue & quartz rose brute\n\n \n\nKit n°4 : \n Tapis tirage de cartes symboles Astro en velours pour vos soirées célestes. Le tapis de cartomancie permet de recentrer les énergies et d’élever votre esprit pour un moment magique. No distraction, full sensations <3 \nDimensions : 80 x 80cm \n\n\n\n\nCouleur : noir et doré\nMotifs : Symboles astro\nFacile à plier et à emporter",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-05-11T00:35:20.174Z",
  "updatedAt": "2025-06-11T14:55:45.876Z",
  "downloadedAt": "2025-08-03T02:20:55.943Z"
}
