{
  "id": "ZXKHQAHIJ2EV6URMXGEX7HV7",
  "name": "Brightening  Lifting Floral Gel Toner",
  "description": "<p>This gel toner is produced from luxurious flower waters and pomegranate extract to brighten the face's complexion and lift it.&nbsp;Pomegranate extract with high molecular weight carbohydrates provides&nbsp;immediate tightening and lifting benefits.</p><p>&nbsp;<br></p><p><strong>For Whom:&nbsp;</strong></p><p>For all skin types (Normal to Dry Skin)</p><p><strong>How to use</strong>:</p><p>Use an appropriate amount of toner onto clean hands and pat onto face and neck. Let the toner be fully absorbed into your face. Apply AM &amp; PM after the cleanser.</p><p><strong>Warning:&nbsp;</strong></p><p>For external use only. Avoid direct contact with eyes and mouth. If irritation occurs, discontinue use. Keep out of reach of children.</p><p><strong>Storage:</strong></p><p>Store in a cool and dry place (preferably fridge as this product doesn't have artificial and chemical preservatives).&nbsp;Use within 6 months of opening.</p><p><br></p><p><strong>Key Ingredients:&nbsp;</strong>Pomegranate Extract,&nbsp;Green Tea Extract,&nbsp;Lavender Hydrosol,&nbsp;Rose Flower Water.</p><ul><li>Pomegranate Extract: Pomegranate is considered a super fruit because of its unique antioxidant benefits as well as its high nutritional value. Pomegranate extract which is extracted along with its high molecular weight carbohydrates. When applied on the skin, provides immediate tightening and lifting benefits that help reduce the appearance of sagging and wrinkles.</li><li>Green Tea Extract:&nbsp;Extracts of green tea contain polyphenols such as catechin and gallocatechin. They increase the physical appearance of&nbsp;aging by breaking down capillary strength. Using green tea helps boost the&nbsp;ability product&nbsp;to protect your skin from environmental damage while diminishing the appearance of&nbsp;aging.</li><li>Lavender Hydrosol: It is a gentle, soothing and relaxing ingredient which refreshes and calms the skin.</li><li>Rose Water:&nbsp;Rose water helps hydrate, revitalise and moisturise the skin giving it with that refreshed look.</li></ul><p><strong>FULL INGREDIENTS</strong>:&nbsp;Aqua (Purified Water),Rosa Centifolia (*Rose) Flower Distilled, Aloe Vera Barbadensis (*Aloe Vera)Leaf Juice, Lavandula angustifolia (*Lavender) Flower Extract, Camellia Sinensis (*Green Tea) Leaf Extract, *Vegetable Glycerin, **AcaciaSenegal Gum &amp; Xanthan Gum,Tocopherol (*Vitamin E), **Lactobacillus Ferment Lysate &amp; **Camellia Sinensis Leaf Extract &amp; Punica Granatum (**Pomegranate) Extract &amp; **Caffeine, Pelargonium Graveolens (**Rose Geranium) Essential oil, **Natural Preservative (Benzyl Alcohol, Salicylic Acid, Glycerin, Sorbic Acid), **Natural PH Modifier (Lactic Acid).</p><p><strong>*Organic Certified, **Natural,&nbsp;100%Vegan</strong></p><p>&nbsp;<br></p><p>Handmade in small batches in Texas | Cruelty-Free | Environment-Friendly | No parabens, chemicals, glycerin, fragrance, hormones, silicones, petroleum products, artificial preservatives, fillers, multisyllabic additives, and&nbsp;unnatural additives.</p><p><br></p><p>Disclaimer: The products and statements made about specific products on this&nbsp;website&nbsp;have not been evaluated by the United States Food and Drug Administration (FDA) and are not intended to diagnose, treat, cure or prevent disease. All information provided on this&nbsp;website&nbsp;or any information contained on or in any product label or packaging is for informational purposes only and is not intended as a substitute for advice from your physician or other&nbsp;healthcare&nbsp;professional. You should not use the information on this&nbsp;website&nbsp;for diagnosis or treatment of any health problem. Any testimonials on this&nbsp;website&nbsp;are based on individual results and do not constitute a guarantee that you will achieve the same results.&nbsp;</p>",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-08-01T09:33:11.498Z",
  "updatedAt": "2025-08-01T09:48:18.69Z",
  "downloadedAt": "2025-08-03T02:21:34.187Z"
}
