{
  "id": "IC4OIS5YZVSM2I4LIJWXKPII",
  "name": "TVM Tote Bag",
  "description": "Introducing the Tresor Vintage Market All-Over Print Tote Bag, a versatile and stylish addition to your everyday look. This tote is designed to combine practicality with vintage elegance, making it the perfect accessory for your daily outings. Whether you're carrying your laptop, notebook, or other essentials, this bag can handle it all with ease.\n\n\nProduct Details\n\nMaterial: 100% polyester\n\nFabric Weight: 6.64 oz./yd.² (225 g/m²), may vary by 5%\n\nBag Size: 15″ × 15″ (38.1 × 38.1 cm)\n\nCapacity: 2.6 US gal (10 l)\n\nMaximum Weight Limit: 44 lbs. (20 kg)\n\nHandles: Dual handles made from 100% natural cotton bull denim, 11.8″ (30 cm) in length and 1″ (2.5 cm) in width\n\nDesign: Printed, cut, and hand-sewn by our in-house team\n\nCertification: Fabric is OEKO-TEX 100 standard certified\n\nOrigin: Blank product components sourced from Israel\n\nFeatures\n\nDurability: The bag is sturdy and capable of carrying up to 44 lbs., making it perfect for heavy loads.\n\nComfort: Dual handles ensure easy carrying, crafted from natural cotton bull denim for added comfort.\n\nEco-Friendly: OEKO-TEX 100 standard certified fabric, ensuring it's free from harmful substances.\n\n\nBenefits of On-Demand Manufacturing\n\nThis product is made especially for you as soon as you place an order, which helps reduce overproduction and promotes sustainable, thoughtful purchasing decisions. Thank you for supporting eco-friendly craftsmanship!\n\n\nTraceability\n\nKnitting: China\n\nDyeing: China\n\nManufacturing: Latvia\n\nNote: This item releases plastic microfibers into the environment during washing. Contains 0% recycled polyester and 0% dangerous substances.\n\n\nEmbrace Style and Functionality\n\nUpgrade your accessory collection with the Tresor Vintage Market All-Over Print Tote Bag. Its unique design and high-quality materials make it a bestseller in our store. Order now and carry your essentials in style with this elegant and durable tote bag!\n\n\nThis product is made especially for you as soon as you place an order, which is why it takes us a bit longer to deliver it to you. Making products on demand instead of in bulk helps reduce overproduction, so thank you for making thoughtful purchasing decisions!",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 2,
  "variations": 1,
  "createdAt": "2024-07-26T03:42:28.123Z",
  "updatedAt": "2025-06-11T15:01:35.181Z",
  "downloadedAt": "2025-08-03T02:16:47.911Z"
}
