{
  "id": "2BJBJVLDGZ25SFCOY4KBASLA",
  "name": "The Rider Waite Purple Neon Foil Tarot Deck",
  "description": "-Neon Foil\n-Anti-Scratch Lamination for Tarot Deck\n-Tarot Cards With Guidebook\n-Witchy Gift\n-Classic Tarot Deck\n-Premium Cardboard for Tarot Cards 350GSM\n-78 Cards Classic Tarot School 22 major arcana and 56 minor\n-Size 2,75 x 4,72 inc / 7x12sm\n-One guide book 36 pages\n-Cardboard box\n-Perfect for masters, beginners, and everyone in between\n-The Perfect gift set\n-Red Velvet Tarot Bag,soft and durable\n-Size 7,8x5,9 inc / 20x15sm\n-Black Gabardine Tarot Cloth\n-Size 18x18 inc / 46x46sm\n-Black Wooden Tarot box\n-Size 5x3,5x2 inc / 13,6x9,2x5sm\n-Fast production and delivery in the USA\n(1-3 business days for production and packing, 2-5 business days for delivery)\nLooking for a tarot card deck that stands out from the rest?\nLook no further than Purple Neon Foil Tarot Cards Deck on !\nThis one-of-a-kind tarot deck features a unique purple neon foil design that will add a touch of elegance and mysticism to your tarot readings.\nMade with high-quality card stock, these tarot cards are durable and easy to shuffle.\nThe unique neon foil design adds an extra touch of magic to your readings, making them more immersive and intuitive.\nWhether you're an experienced tarot reader or just starting out, this deck is perfect for personal use or as a gift for loved ones who are interested in spirituality and self-discovery.\nOrder now and get free bag if you buy a wooden box.\nDon't miss out on the opportunity to elevate your tarot reading experience with this one-of-a-kind Purple Neon Foil Tarot Cards Deck.\nCheck out our 5-star customer reviews and see why this deck is a must-have for any tarot enthusiast.\nDon't wait, get your Purple Neon Foil Tarot Cards Deck today and add a touch of magic to your readings.\n\nDesign and Branding Copyright Tarot Cards Dark Forest",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 7,
  "createdAt": "2025-05-11T00:37:31.886Z",
  "updatedAt": "2025-06-11T14:01:21.294Z",
  "downloadedAt": "2025-08-03T02:20:57.932Z"
}
