{
  "id": "MADULK4PXR6G3XJOFGPXSN2M",
  "name": "Hair & Nail Mask for long hair growth and healthy",
  "description": "This hair and nail mask will provide the nutrition that your hair and nails have been searching for. Chalked full of nutrients like Shea Butter, Meadowfoam Oil, Hemp Seed Oil you can have the hair you've always wanted. Organic Shea Butter- Raw shea butter is rich in stearic, oleic acids and benefit-rich vitamin E and vitamin A which makes your hair longer and stronger and shiny. Organic Illipe Butter-Restores elasticity making hair stronger and repairing damage. Organic Coconut Oil- Helps your hair grow longer, faster and stronger. Also repairs scalp and will aid in the elimination of any scalp issues. Organic Hemp Seed Oil- Strengthens, conditions, improves elasticity and softens. Organic Jojoba Oil- Resolves scalp issues and protects hair from damage. Organic Kukui Nut Oil- Conditions, repairs and strengthens. Organic Meadowfoam Oil- Hydrates the hair and scalp by locking in moisture. Repairs and rejuvenates dry scalp and hair. Organic Evening Primrose Oil- Fights against hair loss. Organic Argan Oil- Adds shine, softness and silkiness. Tames frizz and repairs damaged hair and split ends. Organic Basil Essential Oil- Encourages hair growth and slows hair loss. Shop Info: We believe that your skin is just as vital as any other organ in your body. Here at Butter Me Up Organics we like to say, \"Don't put anything on your body that you wouldn't put in it.\" So, on that note, all of our products are completely edible. They may not be so tasty, however, but everything we use are non- toxic premium ingredients. Can you say that about the products you're currently using? Other Info: Organic Completely cruelty free No sulfates, phthalates or parabens…ever No synthetic dyes or fragrances Completely all natural and safe Zero waste company Packaging upcycled when possible Everything is made with love <3",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-06-12T18:47:08.318Z",
  "updatedAt": "2025-08-01T08:33:27.051Z",
  "downloadedAt": "2025-08-03T02:21:31.963Z"
}
