{
  "id": "T6CZYYX3DQIOV5WU2XIBOS54",
  "name": "Vintage Paris Flower Market Screen Print Art With Hollow Iron Frame",
  "description": "Introducing the Vintage Paris Flower Market Screen Print Art with Hollow Iron Frame, a stunning embodiment of timeless creativity. Screen printing, an ancient art form that dates back to 960 A.D., serves as the foundation for this exquisite piece, offering a unique way to enhance your space with artistic flair.\n\n\n\nThis vintage-inspired screen print captures the essence of industrial charm, making it an attractive conversation piece for various settings, from the coziness of your home to the sophisticated atmosphere of an office or retail space. With its striking design, it is perfect for creating an eye-catching store display that not only promotes handbag sales but also serves as an exquisite decorative accessory even after the display's purpose is fulfilled.\n\n\n\nThe artwork is elegantly framed in a hollow iron frame that measures 25-1/2\" W x 20\" H and 1\" D. Weighing 2 lbs., it comes equipped with attached hanging brackets, ensuring a swift and effortless installation on any wall. This functionality is paired with a rugged aesthetic; the distressed frame and variations in color\ntones reflect the artisanal process behind each piece, highlighting its unique characteristics.\n\n\n\nIt is important to note that these screen prints have been utilized in the production of our handbags, resulting in distinct variations that lend authenticity and charm. Each piece is not new or flawless, which enhances its allure and signifies its history. This art piece invites admiration for its imperfections and storytelling nature, making it a valuable addition to your collection.\n\n\n\nElevate your decor and ignite conversations with the Vintage Paris Flower Market Screen Print Art, an extraordinary fusion of art and functionality that celebrates the beauty of history in every detail.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 3,
  "variations": 1,
  "createdAt": "2025-06-11T19:08:31.793Z",
  "updatedAt": "2025-08-01T08:18:56.756Z",
  "downloadedAt": "2025-08-03T02:21:26.410Z"
}
