{
  "id": "FYH5SNKEP3MIX76X6AIESRPJ",
  "name": "The Lumination Holographic Purse",
  "description": "The Lumination Holographic Purse will elevate your standards of fashion to new heights. This light-reflective, color-changing purse was designed to be carried anywhere for your convenience. Due to its lightweight nature, the purse is perfect to grab and go. Moreover, what makes this purse unique is that it shines even during the day! Each unique angle of the purse will provide you with a vibrant array of colors.  With this purse, you will have everyone screaming \"WOW\". This high-quality purse shines like no other and is calling for you to buy it.\n\nAre you the type of person that always carries their phone and wallet with them wherever they go? It would be great to have something to carry those small items in, but a handbag is just too big. If so, the Lumination Holographic Purse is just the bag for you. The purse was crafted to be the right size for any miscellaneous items. \n\nAre you the type of person who loses track of their everyday items easily? Well, the Lumination Holographic Purse can change that for you. Now, you will have the most efficient (and stylish) way to store your phone, wallet, and maybe even some chapstick. Thanks to the purse's unique ability to shine bright, there is no way you will be able to lose it amongst your other belongings.\n\nLumination believes in standing out from the rest no matter the occasion. That includes small items like purses that people may not pay much attention to. If you truly want to achieve complete freedom of expression, then the Lumination Holographic Purse is the bag for you. \n\nThe colors on this purse cannot be compared to any other purse on the market. The design of the purse captures the warmth, joyfulness, and the desire to shine in any environment. \n\nSizing & Materials\n\nThe Lumination Holographic Purse's exterior is crafted with polyurethane leather. This means that this bag is made 100% free of animal cruelty. \n\nThis Purse is 7 inches tall, 11 inches wide, and 2.9 inches deep.\n\nChain Strap\nThis Purse includes an additional chain strap, featuring Lumination's GunMetal Color technology. This strap is fully detachable and adjustable, allowing you to fully customize the looks and feels of your purse!\n\n\n\n\nDesign, Storage, & Features\n\nThe interior of this purse is crafted with Lumination's Purple Soul Lining, created from fiber cloth and polyester.\nIncludes one, interior zipper compartment, allowing you to securely store small objects. \n\nFeaturing a smooth zipper close, allowing you to fully seal your purse.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 4,
  "variations": 1,
  "createdAt": "2025-06-11T17:41:40.813Z",
  "updatedAt": "2025-08-01T08:06:44.064Z",
  "downloadedAt": "2025-08-03T02:21:24.743Z"
}
