{
  "id": "GQCMNDE22KPQ4TX2CQADPG32",
  "name": "Handmade Olive Wood Bottle Holder | Available in Two Designs",
  "description": "Add style and functionality to your countertop, dining room, or living space with this handmade vintage bottle holder made from premium Tunisian olive wood. This beautifully designed holder can hold 2 bottles, making it a perfect addition to any space. Whether you're displaying wine bottles or other decorative bottles, this piece adds a mid-century vintage touch to your home decor.\n\nThe tightly grained olive wood is extremely sturdy and durable, making it ideal for daily use and an elegant display piece. With its natural wood finish and sleek design, it not only serves a practical purpose but also becomes a statement piece in your home.\n\nWhether you're looking for a unique gift or just want to add some rustic charm to your home, this olive wood bottle holder is a perfect choice.\n\n\n Sustainability CommitmentFor every order, we plant a tree in partnership with \"TREES FOR THE FUTURE\" . When you purchase this handmade item, you help contribute to reforestation efforts and a greener planet.\n\n Why Choose Our Handmade Olive Wood Bottle Holder?\n\n\nHandcrafted from Premium Olive Wood: Made from high-quality, sustainably sourced Tunisian olive wood.\n\n\n\nElegant & Functional Design: Holds 2 bottles securely and stylishly.\n\n\n\nDurable & Sturdy: The tightly grained olive wood makes this piece perfect for daily use.\n\n\n\nPerfect Gift Idea: Ideal for wine lovers, housewarming parties, or anyone who enjoys rustic home decor.\n\n\n\nEco-Friendly: Sustainably sourced olive wood to support ethical craftsmanship and environmental sustainability.\n\n\n\n\nDimensions:\n\n\nSize of Holder:\n\n\n\nLength: 26 cm (10.23 inches)\n\n\n\nHeight: 15 cm (5.9 inches)\n\n\n\nWidth: 6 cm (2.36 inches)\n\n\n\n\n\n\n Care Instructions\n\n\nWash with warm water and regular soap.\n\n\n\nCondition with olive oil or corn oil if the wood appears dry. Apply a small dab to a paper towel and gently rub.\n\n\n\nAvoid soaking or using the dishwasher. To maintain the wood's natural beauty, avoid prolonged water exposure.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 2,
  "createdAt": "2025-05-11T00:35:37.339Z",
  "updatedAt": "2025-06-11T15:01:30.319Z",
  "downloadedAt": "2025-08-03T02:20:56.437Z"
}
