{
  "id": "34MB4OI7TPSRQ6ZMV6SFBDRW",
  "name": "Selenite Bubble Lamp",
  "description": "Relaxing Selenite Bubble Lamp. LED on/off Tealight included 100 hours battery operated CR2032 warm yellow flame. Size: 2.5\" diameter.\n- Selenite Crystals are remarkably peaceful. The crown chakra is associated with the Selenite stone and aside from this you can use Selenite to contact your Guardian Angel or Spiritual Guides.\n- Cleansing and clearing other crystals of negative energies and vibrations is another wonderful property of Selenite.\n- Unlike other metaphysical stones. It ensures a peaceful environment when stones are placed around the home and is an excellent stone for meditation.\n- Amazing size for a gift. Harmonizer decoration item for a night stand, office desk or to bring with you all the time in your bag. Each piece differ in shape, weight and size. This has been hand cut by Morrocans artisans.\n\nBrand:\nOur brand CuartoAstral is and old idea that was developed little by little with angelic assistance.\n\nCuarto Astral means in English Astral Room; it is this place, this room, where you can escape to reconnect.\n\nPurpose: the main purpose of CuartoAstral is to deliver and share information and products that facilitate connection with high realms. Besides, taking care of our own families, some of us are here on earth to spread information, in order to change consciousness and prepare society for the new age; Aquarius age.\n\nPlan: Therefore, we are selling crystals and incenses, carefully picked and handled with the intention of delivering healing into homes with the highest quality reasonably priced. Our employees were carefully selected and we made sure with an astral chart, they were sensitive enough to deal with this new venture.\n\nOur brand has an spiritual healing mission. Therefore, our marketing slogan \"SHOPPING WITH A HEALING PURPOSE\". We have made sure that our products are being exposed to Reconnective healing frequencies and harmonic sounds and vibrations to cleanse all our crystals, while stored for activation and clarity.\n\nGoal: When you get one of our products, be sure you will feel the spiritual protection and calmness that you need to reconnect.\n\nThe logo is the natal chart of our founder, it is the best business card and picture of the sky at birth time. It shows her strengths, weaknesses and purposes in life.\n\nWe truly hope you enjoy our brand and we are really happy we are able to deliver these beautiful energies in your homes.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-05-11T06:54:11.675Z",
  "updatedAt": "2025-06-11T01:32:17.51Z",
  "downloadedAt": "2025-08-03T02:21:10.304Z"
}
