{
  "id": "XE2OKQZL5PE5EFMQVODVZHME",
  "name": "16 Colors Sunset Projection Lamp Sunset Lamp",
  "description": "Features:\n【RGB Multiple Color 】The sunset light with 16 Static and dynamic colors (sunset red, sun light, rainbow light etc.) allows you to have a romantic and modern bedroom. The high-quality crystal has strong light transmission and refraction, wider luminous surface and stronger light, creating a romantic and classical atmosphere.\n\n【High-Quality Materials】Lamp caps, lamp pole and holders are all made of metal, touch with smooth and delicate, more wear-resistant and corrosion-resistant than which made of plastic，and the glass lens provide strong light transmission and wider refraction.\n\n【Rotation Flexible】The lamp holder can be rotated 180 degrees to meet your needs. Different light can be produced from different angles to bring different effects to your room. The size and shape of the halo can be adjusted by rotating the light.\n\n【Remote Control】sunset lamp can control 16 colors, brightness adjustment, Jump/Strobe/Gradient/Smooth gradient 4 modes changing，Very convenient to use.\n\n【Special Gift】All you need is a lamp, which can enhance the atmosphere of your home or party. On some special days, it can add a romantic atmosphere to your event. This kind of night light is not only very suitable to be placed in your home, but also suitable for family celebration dinners in the garden/backyard or other special occasions. It is especially suitable for Christmas gifts, birthday gifts and housewarming gifts. Is the first choice for gifts.\n\n\n\n\n\n24 Keys IR Remote\n\nPlease Noted:\n\n\n\nPlease aim the remote control at the HD crystal LED lens\n\nPlease remove the plastic film from the remote control\n\n\n\n\n\nEnjoy the sunset and rainbow with our loved ones.\n\n\n\nInstructions:\n\nLuminous color:16 colors\n\nSunset light: Compact and lightweight, easy plug & play;\n\nRemote Control: In order for the battery to last for a long time,we \n\ninserted an insulated plastic card between the battery and the \n\nremote control. Please unplug the plastic card when using it.\n\n\n\nPacking List:\n\n1, sunset light 1pcs\n\n2, Manual 1pcs\n\n3, Remote controller 1pcs\n\n\n\nProduct Specifications:\n\n1, Power power: 6W\n\n2, Power supply voltage: 5V / 1A\n\n3,Product size: 270 * 100 * 100mm\n\n4, Material: Iron base + Aluminum head casting\n\n5, Control modes: Remote Control",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-06-11T23:39:42.757Z",
  "updatedAt": "2025-08-01T08:30:39.815Z",
  "downloadedAt": "2025-08-03T02:21:27.202Z"
}
