{
  "id": "YISZ3P2WUTBYRZF2RK5ODKGM",
  "name": "The Lumination Holographic Backpack",
  "description": "The Lumination Holographic Backpack is universally praised for its elegant design and versatility. The color-changing technology incorporated in the backpack will elevate your style and make you the recipient of thousands of compliments. The lightweight nature of the backpack allows you to travel freely without being held back. The backpack is optimally designed to enhance comfort and prevent strains when worn. This high-quality backpack is fashionable during day and night and is perfect for carrying your amenities.\n\nSure, a backpack that shines during the night is cool. But a backpack that can shine during the day is even cooler. The Lumination Holographic Backpack is your ideal bag to take on any journey. This backpack is crafted with the perfect blend of style and comfort all while being able to match with any outfit. \n\nSocial media experts will agree that this backpack is perfect to step up your Instagram game and launch your influencer career. With the Lumination Holographic Backpack, you can turn a casual hike into a fantastical adventure with a bag that shines like magic. \n\nNeed a backpack for school or work but everything is just too big? Then the Lumination Holographic Backpack is perfect for you! We understand how uncomfortable it can be when it feels like your backpack is bigger than you. That's why we designed the backpack to be just the right size to carry anywhere.\n\nSizing & Materials\n\n\n\nThe Lumination Holographic Backpack's exterior is crafted with polyurethane leather. This means that this bag is made 100% free of animal cruelty. \n\nThis Backpack is 15.15 inches tall, 13 inches wide, and 6 inches deep.\n\nDesign, Storage, & Features\n\nThe interior of this backpack is crafted with Lumination's Purple Soul Lining, created from fiber cloth and polyester. \nIncludes one, interior zipper compartment, allowing you to securely store small objects.\nIncludes two, interior open pockets, which are lined with reflective trim. \nAdjustable closing and straps, allowing you to ensure a snug and secure fit.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-06-12T00:23:33.539Z",
  "updatedAt": "2025-06-12T03:36:07.26Z",
  "downloadedAt": "2025-08-03T02:21:29.440Z"
}
