{
  "id": "3NAAOJOQ5IJLJCYO5VK7HWXN",
  "name": "High Vibe Home Kit with Selenite, Palo Santo, Copal, Black Tourmaline,",
  "description": "Your home is a reflection of your personality and a sacred space. This high-vibe home kit is designed to help you clear negative energy and infuse positive energy, clarity, and supportive loving vibrations into your space and life.\n\nInfuse the air with negative ions from sacred herbs and resins, and use the antiviral/antibacterial Copal and Palo Santo to improve the air quality and energetics of your sacred space. Protect and enliven your home with crystals, bringing in the energy of luck, prosperity, abundance, grounding, and love.\n\nHere’s what’s included in your kit:\n\n- Selenite: A pale white crystal that neutralizes negative energy, helps you stay in the “flow of life,” and allows you to let go of resistance. Place it at the entrance to your home or on your altar.\n\n- Palo Santo: A piece of wooden incense derived from a sacred tree used for thousands of years to bring blessings and cleanse the energetic body (aura). Moon and Jai Palo Santo is sustainably harvested. Palo Santo has a citrusy woodsy scent that uplifts the energy in your home.\n\n- Copal: A natural resin incense used to energetically purify your aura and space, eliminating dense and stagnant energy. It has a pleasant slightly musky scent and is used to burn away negativity, supporting positive changes.\n\n- Black Tourmaline: A grounding crystal that connects you deeper to your roots and the Earth. It helps neutralize electromagnetic radiation and acts as a stone of purification, absorbing negative energy and creating a protective energy shield around your home.\n\n- Rose Quartz: A soothing and comforting stone of love, perfect for your bedroom. It reminds you to be gentle with yourself, restores harmony, and assists in building self-love.\n\n- Tiger’s Eye: A stone of good luck and prosperity, ideal for your work area or living room. Its healing properties come from the Sun and Earth elements, giving it both grounding and inspiring vibrations. Its optimistic and stabilizing energy helps you see any situation in a positive light.\n\n- Moon and Jai Matches: Light the fire of manifestation!\n\n- Ritual Guidance: A thorough guide on performing your ritual.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-05-11T08:52:35.864Z",
  "updatedAt": "2025-06-11T15:01:39.555Z",
  "downloadedAt": "2025-08-03T02:21:15.506Z"
}
