{
  "id": "FR5MLBIWHCAIL2TFGOE56T33",
  "name": "Organic Magnesium Lotion / Magnesium / Magnesium Cream / Magnesium",
  "description": "I am SO excited about this product!!!!! The American diet is extremely deficient in Magnesium and it is suspected that nearly everyone needs more magnesium. It is needed for 300 biochemical reactions in the body! The interesting thing about this mineral is that it is more readily absorbed by the skin than internal supplements. I make my own pure magnesium oil and use this as a base for this lotion. Only a small amount is needed. I prefer putting it on my feet, then covering them with socks before bed. A grape-sized amount will offer approx. 500 mg. of magnesium.\n\nThere are so many AMAZING benefits to Magnesium and you will feel the effects immediately. Just Google them and see! Again, I'm so excited about this product and I know you will be too!\n\nIt comes in a 2 oz. or 6oz. GLASS jar with a metal lid.\n\nThis magnesium lotion is nicely blended and easy to apply. Not chunky or chalky.\n\nTo the magnesium chloride oil, I add Organic Avocado Oil, Organic Shea, Organic Coconut Oil, Lavender Oil and Local Beeswax. All of these items are great at keeping your skin hydrated, your mind strong, and happy knowing that all items are sustainable and pesticide-free.\n\nWhat others are saying:\n\n\"This product is a miraculous cure and relief for my restless leg syndrome. I read about this new product on the seller's Facebook page and I was eager to try it. For a little over a week, I have been rubbing it on my feet at night and whatever is left on my hands is massaged into my legs. From the first application, my discomfort has been eliminated, leading me to believe I do have a diet that lacks magnesium and this lotion is the exact help I needed. Please continue making this lotion and promoting it to help others. I am grateful!!!\"\n\n\"I love this lotion. My husband usually is bothered by my lotions at night, but the smell is light enough that he has been using it too. Very thick & moisturizing.\"\n\n\"I have never had much trouble getting to sleep. I like to think of myself as a master sleeper. however, I do have trouble getting good sleep. My mind wanders throughout the night, I get jittery, wiggly, and wake up worrying. this lotion feels like its made for kings and queens. I sleep so deep and feel the difference when I miss a night. Since I have started using this, if I miss a night, I feel as though I didn't get any sleep and I yearn to go home and put some on just to get a good night's sleep. It's literally like magic. don't put too much on but put enough as if it were normal lotion. that worked best for me. I know it's pricey but I found that if I skimp, it doesn't work as well.\"\n\n\"Love! Love! Love this! Great container for dispensing. This lotion is too thick for squeeze bottles. My 5-year-old puts this on herself each night at bedtime. The whole family loves it. Thank you.\"\n\n\"Wonderful lotion! I just apply it as a foot lotion before going to bed and sleep wonderfully! Thank you so much!\"\n\n\n\nShop Info:\n\nWe believe that your skin is just as vital as any other organ in your body. Here at Butter Me Up Organics, we like to say, \"Don't put anything on your body that you wouldn't put in it.\" So, on that note, all of our products are completely edible. They may not be so tasty, however, but everything we use is non- toxic premium ingredients. Can you say that about the products you're currently using?\n\nOther Info:\n\nOrganic\n\nNon-GMO\n\nCompletely cruelty-free\n\nNo sulfates, phthalates or parabens…ever\n\nNo synthetic dyes or fragrances\n\nLabels printed on recycled paper from eco-friendly soy-based inks\n\nCompletely all-natural and safe\n\nZero waste company\n\nMailing packaging upcycled when possible\n\nEverything is made with love <3\n\n***This product has not been approved by the FDA though the individual ingredients have. This is not intended to replace the advice of a physician nor is it intended to treat, cure or prevent any disease.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 2,
  "createdAt": "2025-05-11T00:35:38.058Z",
  "updatedAt": "2025-06-11T01:27:15.52Z",
  "downloadedAt": "2025-08-03T02:20:56.457Z"
}
