{
  "id": "ANLYIB7JZEJ6GRM3OMVBU7T2",
  "name": "Handmade Olive Wood Salt Double Layer – Rustic & Sustainable Kitchen",
  "description": "<p><font color=\"#172b4d\" face=\"Open Sans, sans-serif\"><span style=\"font-size: 16px; white-space-collapse: preserve;\">If you appreciate a well-organized kitchen, you will be captivated by this handcrafted Wood Salt Double Layer crafted from olive wood. Skilled artisans dedicate their time to meticulously carving each piece, allowing the wood’s golden hues and distinctive grain patterns to radiate, ensuring that no two are identical. Its rustic, handcrafted aesthetic enhances the inviting atmosphere of your kitchen, regardless of your preferred style—sleek and modern or cozy and country.</span></font></p><p><font color=\"#172b4d\" face=\"Open Sans, sans-serif\"><span style=\"font-size: 16px; white-space-collapse: preserve;\">This salt box is designed with utmost convenience. It features two layers: the top layer for your primary salt, and the bottom layer for storing a reserve. The sliding lid seals securely to preserve the freshness of your salt, even in humid kitchen environments. With a capacity of approximately 5 ounces, it accommodates daily use without compromising counter space.</span></font></p><p><font color=\"#172b4d\" face=\"Open Sans, sans-serif\"><span style=\"font-size: 16px; white-space-collapse: preserve;\">The olive wood sourced from sustainable orchards aligns with environmentally responsible practices. It undergoes meticulous sanding and finishing with food-grade oil, ensuring durability and ease of cleaning. A simple wipe with a soft cloth suffices to restore its pristine condition.</span></font></p><p><font color=\"#172b4d\" face=\"Open Sans, sans-serif\"><span style=\"font-size: 16px; white-space-collapse: preserve;\">Beyond its practicality, this double-layer salt box infuses your kitchen with a touch of charm. It serves as an exceptional gift for culinary enthusiasts or a thoughtful way to incorporate handmade elements into your personal space. Whether you are preparing a quick meal or experimenting with novel recipes, this olive wood salt holder elevates the seasoning experience.</span></font></p>",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-08-01T09:38:12.567Z",
  "updatedAt": "2025-08-01T09:38:19.831Z",
  "downloadedAt": "2025-08-03T02:21:34.484Z"
}
