{
  "id": "72DRBWRSYUSUBMVNB4PQDSZ7",
  "name": "I am loved - Eternal Love Crystal Infused Reed Diffuser - Rose Scented",
  "description": "Includes:\n\nRose Quartz and Amethyst\n\n Attracts long-lasting commitment in relationships, healing of the heart as well as love & romance.\n\nAll of our crystal-infused diffusers are handmade with an eco-solvent reed diffuser base system derived from plant feedstocks and contain NO VOCs (Volatile Organic Compounds). This delivers superior performance compared to other diffuser bases which can be harmful to the environment.\n\nReed Diffusers are the perfect way to freshen up any indoor area of your home or workspace without the need for flame from a candle or electricity from an electric melt warmer. The natural fibre reeds continuously release a clean, pure fragrance throughout the space. Simple turn reeds over once a week to recharge and release a new wave of fragrance.\n\nSize: 225mls \n\nDIRECTIONS OF USE\nSTEP 1 – Remove the stopper and insert the reeds. After 1 hour, flip the reeds to saturate the other end of the reeds.\nSTEP 2 – Place your reed diffuser where people pass throughout the day, this encourages air circulation and lifts the fragrance. If you like a fuller fragrance, use all the reeds provided, for a lighter fragrance use fewer reeds.\nSTEP 3 – Flip reeds every time you notice the scent dissipating (this is usually once a week). Your reed diffuser can last up to 6 months, depending on the bottle size and air condition it is placed in.\nSome factors that will affect how long your reed diffuser will last and the amount of fragrance it releases are\n• Number of reeds used\n• The airflow around your diffuser, If close to a fan, air conditioning or open window the reeds will soak up oil faster.\n\nWARNING\n• Do not light the reeds.\n• Ensure your Reed Diffuser is placed out of reach of children and pets\n• Ensure your Reed Diffuser is in an area it will not be knocked over\n• If spilt, clean the area immediately as the liquid can damage surfaces.\n• Keep away from electrical appliances\n• Do not ingest liquid",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "UNAVAILABLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-05-11T08:48:58.407Z",
  "updatedAt": "2025-06-11T15:01:31.287Z",
  "downloadedAt": "2025-08-03T02:21:12.107Z"
}
