{
  "id": "B5YLX7UI7BHROWYJZGUTYO56",
  "name": "Sophia-Swarovski",
  "description": "The Perfect Heel For Every Occasion\n\nWhile variety is the spice of life it’s important to have a few luxurious wardrobe staples that can mix and match countless ways. As a woman who is on the go but needs to look her best this includes a stiletto that works for every occasion—and we’ve found the perfect solution!\n\nIt’s All About The Heel\n\nSofroniev stilettos instantly attract attention. From the front your eyes are delighted by the soft and smooth Italian leather, but the sides and back are where the magic begins. While their versatile designs vary the heel remains the same, an artful upside down Eiffel Tower—elevating your classic black pump. Celebrate style and the fashion-forward city you love with every outfit you wear.\n\nYour New Travel Go To\n\nWhether you are traveling for work, taking a quick weekend away, or jet setting around the world you require luxury footwear that can keep up with you. As you already know stilettos take up precious space when traveling light so keep things simple with a black Sofroniev design. They go with everything from your skinnies to your daywear, cocktail dress or evening gown. You’ll still need another shoe or two, but your Eiffel Towers will be your go-to.\n\nComfort And Style\n\nDesigned to be lightweight and durable ensuring you can strut your way down the runway of life with the confidence that your heels can keep up. The soles are leather, and the heel caps are a custom design that prevents heel clicking when you walk. Each Eiffel Tower heel is approximatelyHeel height is about 10cm. / 4.0 inches.  Platform is 2cm. / 0.9 inches. The difference between the height of the heel and the height of the platform of the shoe is about 8 cm. / 3.1 inches.  \n\nThe ideal balance of luxury and style your Sofroniev are guaranteed to be your new favorite heel!\n\n\n\nFeel the spirit of the city of love at your feet! Heels in the shape of Eiffel Tower.  Durability is guaranteed by its lightweight and strong steel structure. Elegant instep to provide your comfort while walking.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 5,
  "variations": 4,
  "createdAt": "2025-06-11T17:13:16.696Z",
  "updatedAt": "2025-08-01T08:42:38.23Z",
  "downloadedAt": "2025-08-03T02:21:24.136Z"
}
