{
  "id": "PZ7FULN6OCDSUAHLUGOFF3UU",
  "name": "Organic Black Drawing Salve / Bee Stings / Rashes / Skin Ailments /",
  "description": "Black Drawing Salve has been used for centuries to pull out toxins from the body in instances like bee stings, poison oak/ivy, rashes or to aid in healing wounds. \n\nThe ingredients in this salve have been chosen specifically for the healing benefits they provide during the time of injury. This blend is antibacterial and naturally pain-relieving. Apply to wound, abscess, ingrown nail, splinter, or sting to draw out toxins. \n\nThis formula is made from an herbal base of Shea Butter*, Activated Charcoal* (Made in the USA from native hardwood), Calendula*, Olive Oil*, Lavender Oil*, French Green Clay, Manuka Honey*, Coconut Oil*, Comfrey*, Plantain*, Lavender*, Chickweed*, Frankincense EO*, Tea Tree Oil*, Beeswax*\n*Certified Organic\n\nShop Info: \n\nWe believe that your skin is just as vital as any other organ in your body. Here at Butter Me Up Organics, we like to say, \"Don't put anything on your body that you wouldn't put in it.\" So, on that note, all of our products are completely edible. They may not be so tasty, however, but everything we use is non- toxic premium ingredients. Can you say that about the products you're currently using? \n\nOther Info:\n\nOrganic\n\nNon-GMO\n\nCompletely cruelty-free\n\nNo sulfates, phthalates or parabens…ever\n\nNo synthetic dyes or fragrances\n\nLabels printed on recycled paper from eco-friendly soy-based inks\n\nCompletely all-natural and safe\n\nZero waste company\n\nMailing packaging upcycled when possible\n\nEverything is made with love <3\n\n***This product has not been approved by the FDA though the individual ingredients have. This is not intended to replace the advice of a physician nor is it intended to treat, cure or prevent any disease.",
  "category": "Uncategorized",
  "productType": "REGULAR",
  "ecomVisibility": "VISIBLE",
  "imageCount": 1,
  "variations": 1,
  "createdAt": "2025-06-11T23:36:26.053Z",
  "updatedAt": "2025-08-01T08:33:27.051Z",
  "downloadedAt": "2025-08-03T02:21:26.709Z"
}
